from django import forms
from .models import *

class Coop13Form(forms.ModelForm): 
    class Meta:
        model = Coop13
        exclude = ('assessorname',)
        labels = {
        'student': 'ชื่อ-สกุล  รหัสนักศึกษา',
        'establishments': 'ชื่อสถานประกอบการ',
        'assessorname' : 'ชื่อ-นามสกุลผู้ประเมิน/Evaluator Name ',
        'verse1':'ข้อ 1 กิตติกรรมประกาศ(Acknowledgement) ',
        'verse2':'ข้อ 2 บทคัดย่อ(Abstract) ',
        'verse3':'ข้อ 3 สารบัญเรื่อง สารบัญตาราง และสารบัญรูปภาพ(Table of contents) ',
        'verse4':'ข้อ 4 วัตถุประสงค์ (Objectives) ',
        'verse5':'ข้อ 5 วิธีการปฏิบัติงาน (Result) ',
        'verse6':'ข้อ 6 ผลการปฏิบัติงาน (Analysis) ',
        'verse7':'ข้อ 7 วิเคราะห์ผลการศึกษา(Analysis) ',
        'verse8':'ข้อ 8 สรุปผลการศึกษา(Conclusion) ',
        'verse9':'ข้อ 9 ข้อเสนอแนะ(Comment) ',
        'verse10':'ข้อ 10 สำนวนการเขียน และการสื่อความหมาย (Idiom and meaning) ',
        'verse11':'ข้อ 11 ความถูกต้องตัวสะกด ครบถ้วนของเนื้อหา(Spelling) ',
        'verse12':'ข้อ 12 รูปแบบ และความสวยงาม ของรูปเล่ม(Pattern) ',
        'verse13':'ข้อ 13 เอกสารอ้างอิง(References)   ',
        'verse14':'ข้อ 14 ภาคผนวก (Appendix) ',
        'comment':'ข้อคิดเห็นเพิ่มเติม/Other comments',
        'titlename' : 'หัวข้อรายงาน/Report title ',
        

    }

class Coop11Form(forms.ModelForm): 
    class Meta:
        model = Coop11
        exclude = ('assessorname4','versefull')
        labels = {
        'establishments': 'ชื่อสถานประกอบการ ',
        'student1': 'ชื่อ-สกุล  รหัสนักศึกษา 1. ',
        'student2': 'ชื่อ-สกุล  รหัสนักศึกษา 2. ',
        'student3': 'ชื่อ-สกุล  รหัสนักศึกษา 3. ',
        'student4': 'ชื่อ-สกุล  รหัสนักศึกษา 4. ',
        'student5': 'ชื่อ-สกุล  รหัสนักศึกษา 5. ',
        'assessorname1' : 'คณาจารย์ผู้ร่วมนิเทศงาน 1. ',
        'assessorname2' : 'คณาจารย์ผู้ร่วมนิเทศงาน 2. ',
        'assessorname3' : 'คณาจารย์ผู้ร่วมนิเทศงาน 3. ',
        'verse1':'1.ความเข้าใจในปรัชญาของสหกิจศึกษา  1.1 มีนโยบายในการสนับสนุนการดำเนินงานสหกิจศึกษา',
        'verse2':'1.2 ผู้บริหารให้ความสำคัญต่อการดำเนินงานสหกิจศึกษา ',
        'verse3':'1.3 บุคลากรที่เกี่ยวข้องตระหนักรู้และเข้าใจเกี่ยวกับหลักการ แนวคิด ตลอดจนประโยชน์ที่สถานประกอบการจะได้รับในการดำเนินงานสหกิจศึกษา ',
        'verse4':'2.การจัดการ และสนับสนุน  2.1 จัดให้บุคลากรที่มีหน้าที่เกี่ยวข้องของสถานประกอบการทำหน้าที่ประสานงานด้านสหกิจศึกษา ',
        'verse5':'2.2 จัดให้มีการปฐมนิเทศ สอนงาน และจัดให้นักศึกษาได้เห็นภาพรวมการดำเนินการของสถานประกอบการ ตลอดจนกฎ ระเบียบ ข้อบังคับ ',
        'verse6':'2.3 จัดให้มีผู้นิเทศงานที่มีคุณวุฒิหรือประสบการณ์ตรงตามสาขาวิชาชีพของนักศึกษา ',
        'verse7':'2.4 จัดให้มีค่าตอบแทนและสวัสดิการในอัตราที่มีความเหมาะสมและจำเป็นตามลักษณะงาน ',
        'verse8':'2.5 จัดให้มีอุปกรณ์เครื่องมือเครื่องใช้ที่เหมาะสมสำหรับการปฏิบัติงานของนักศึกษา ',
        'verse9':'2.6 ความปลอดภัยต่อการปฏิบัติงานของนักศึกษาสหกิจศึกษา) ',
        'verse10':'3. ปริมาณงานที่นักศึกษาได้รับ 3.1 ปริมาณงานที่นักศึกษาได้รับมอบหมาย ',
        'verse11':'4.คุณภาพ 4.1 คุณลักษณะงาน (Job description) ',
        'verse12':'4.2 งานที่รับมอบหมายมีการกำหนดภาระงาน หรือหัวข้อโครงงานที่ตรงกับวิชาชีพและประสบการณ์การทำงานตรงกับสาขาวิชา ',
        'verse13':'4.3 งานที่ได้รับมอบหมายกับที่บริษัทเสนอไว้  ',
        'verse14':'4.4 งานที่ได้รับมอบหมายกับความสนใจของนักศึกษา ',
        'verse15':'4.5 ความเหมาะสมของหัวรายงานที่นักศึกษาได้รับ ',
        'verse16':'4.6 นักศึกษาได้รับการปฏิบัติเสมือนเป็นพนักงานชั่วคราวเต็มเวลาของสถานประกอบการ ',
        'verse17':'5.การมอบหมายงานและนิเทศงาน ของ Supervisor/สถานประกอบการ 5.1 มี Supervisor/สถานประกอบการ ดูแลนักศึกษาตั้งแต่วันแรกที่เข้างาน		',
        'verse18':'5.2 มีกระบวนการการตรวจสอบลักษณะงานและคุณภาพงานให้สอดคล้องกับสาขาวิชาชีพของนักศึกษา และเป็นประโยชน์กับสถานประกอบการ ',
        'verse19':'5.3 มีกระบวนการกำกับดูแลการปฏิบัติงานของนักศึกษา ',
        'verse20':'5.4 มีการตรวจสาระรายงานและให้ข้อเสนอแนะในการเขียนรายงานสหกิจศึกษา ',
        'verse21':'5.5  ความสนใจของ Supervisor/สถานประกอบการ ต่อการสอนงาน และสั่งงาน	',
        'verse22':'5.6  การให้ความสำคัญต่อการประเมินผลการปฏิบัติงานและเขียนรายงานของSupervisor/สถานประกอบการ ',
        'verse23':'5.7 การจัดทำแผนปฏิบัติงานตลอดระยะเวลาของการปฏิบัติงาน ',
        'verse24':'5.8 เป็นผู้มีคุณวุฒิไม่ต่ำกว่าระดับปริญญาตรีในสาขาวิชาเดียวกับนักศึกษาหรือใกล้เคียงหรือเป็นผู้มีความชำนาญในสาขาวิชาชีพกับนักศึกษา ',
        'verse25':'5.9 มีการให้คำปรึกษา ติดตาม แนะนำการปฏิบัติงานสหกิจศึกษาของนักศึกษาและประสานงานกับหน่วยงานต่าง ๆ ภายในสถานประกอบการให้เป็นตามวัตถุประสงค์ ',
        'verse26':'5.10 ประเมินผลการปฏิบัติงานของนักศึกษาและรวบรวมข้อมูลเพื่อนำเสนอต่อสถานศึกษาและองค์กรของตนเอง ',
        'verse27':'5.11 มีกระบวนการให้คำปรึกษาทางวิชาการ วิชาชีพ และให้คำแนะนำในการปรับตัวให้เข้ากับการปฏิบัติงาน   ',
        'verse28':'5.12 มีกระบวนการวัดและประเมินผลการปฏิบัติงานของนักศึกษา ',
        'verse29':'5.13 มีกระบวนการแลกเปลี่ยนเรียนรู้   ',
        'verse30':'6.สรุปคุณภาพโดยรวมของสถานประกอบการ ',
        'comment':'ข้อคิดเห็นเพิ่มเติม/Other comments',
        
        

    }

class Coop112Form(forms.ModelForm): 
    class Meta:
        model = Coop112
        exclude = ('assessorname','versefull')
        labels = {
        
        'student': 'ชื่อ-สกุล  รหัสนักศึกษา ',
        'verse1':'1.การพัฒนาตนเอง 1.1 บุคลิกภาพ',
        'verse2':'1.2 วุฒิภาวะ ',
        'verse3':'1.3 การปรับตัว ',
        'verse4':'1.4 การเรียนรู้ ',
        'verse5':'1.5 การแสดงความคิดเห็น การแสดงออก ',
        'verse6':'1.6 มนุษย์สัมพันธ์ ',
        'verse7':'1.7 ทัศนคติ ',
        'verse8':'2. การแสดงความมีส่วนร่วมกับองค์กร ',
        'verse9':'3. ความประพฤติ คุณธรรม จริยธรรม และการปฏิบัติตามระเบียบวินัยขององค์กร เช่น การลา การขาดงาน การแต่งกาย ',
        'verse10':'4. ความรู้ความสามารถพื้นฐานที่จำเป็นต่อการการปฏิบัติงานที่ได้รับมอบหมายให้สำเร็จ ',
        'verse11':'4. ความรู้ความสามารถพื้นฐานที่จำเป็นต่อการการปฏิบัติงานที่ได้รับมอบหมายให้สำเร็จ ',
        'verse12':'5. ความรู้ความสามารถที่เรียน นำมาประยุกต์ใช้ในการปฏิบัติงาน ',
        'verse13':'6. ความก้าวหน้าของการจัดทำรายงาน(Work term Report) 6.1 ความเหมาะสมของหัวข้อรายงาน ',
        'verse14':'6.2 รายละเอียดเนื้อหาของรายงาน ',
        'verse15':'6.3 แผนปฏิบัติงานสหกิจศึกษา ',
        'verse16':'7. สรุปโดยรวมของนักศึกษา  ',
        'comment':'ข้อคิดเห็นเพิ่มเติม/Other comments',
        
        

    }

class Coop211Form(forms.ModelForm): 
    class Meta:
        model = Coop21
        exclude = ('verse31','verse32','verse33','verse34','verse35','verse36','versefull3','verse37','verse21','verse22','verse23','verse24','verse25','verse26','versefull2')
        labels = {
        
        'verse1':'1.การให้คำแนะนำ ปรึกษา เรื่องโครงงาน ',
        'verse2':'2.ระยะเวลาในการเข้านิเทศงาน 1 ชั่วโมง หรือมากกว่า ',
        'verse3':'3.การติดต่อประสานงานก่อนเข้านิเทศ ',
        'verse4':'4.ความเข้าใจเกี่ยวกับระบบสหกิจศึกษา ',
        'verse5':'5.มนุษยสัมพันธ์ของคณาจารย์นิเทศ ',
        'verse6':'6.ความตรงต่อ เวลา ในการนิเทศ '
        
        

    }
class Coop212Form(forms.ModelForm): 
    class Meta:
        model = Coop21
        exclude = ('verse31','verse32','verse33','verse34','verse35','verse36','versefull3','verse37','verse1','verse2','verse3','verse4','verse5','verse6','versefull1')
        labels = {
        
        'verse21':'1.การให้คำแนะนำ ปรึกษา ของพนักงานที่ปรึกษา ',
        'verse22':'2.งานที่ได้รับมอบหมายตรงกับสาขาวิชาที่เรียน ',
        'verse23':'3.ค่าตอบแทน สวัสดิการที่ได้รับ ',
        'verse24':'4.สถานประกอบการมีความเข้าใจระบบสหกิจศึกษา ',
        'verse25':'5.ความพึงพอใจเกี่ยวกับสถานประกอบการ ',
        'verse26':'6.บรรยากาศโดยรวมของสถานประกอบการ '
        
        

    }

class Coop213Form(forms.ModelForm): 
    class Meta:
        model = Coop21
        exclude = ('verse21','verse22','verse23','verse24','verse25','verse26','versefull2','verse1','verse2','verse3','verse4','verse5','verse6','versefull1')
        labels = {
        
        'verse31':'1.กิจกรรมการรับสมัครงาน ',
        'verse32':'2.กิจกรรมเตรียมความพร้อมก่อนออกปฏิบัติงาน ',
        'verse33':'3.กิจกรรมสัมมนาแลกเปลี่ยนประสบการณ์หลังกลับจากสถานประกอบการ ',
        'verse34':'4.การให้บริการของเจ้าหน้าทีดำเนินงานเกี่ยวกับสหกิจศึกษา ',
        'verse35':'5.มีความเข้าใจเกี่ยวกับสหกิจศึกษา ',
        'verse36':'6.ประโยชน์ที่ได้รับจากประสบการณ์การปฏิบัติงานสหกิจศึกษา ',
        'verse37':'7.การให้คำแนะนำปรึกษาของคณาจารย์ที่ปรึกษาสหกิจศึกษาประจำสาขาวิชาร ',
        
        

    }

class Coop20Form(forms.ModelForm): 
    class Meta:
        model = Coop20
        exclude = ('assessorname','versefull')
        labels = {
        
        'student1': 'ชื่อ-สกุล  รหัสนักศึกษา ',
        'student2': 'ชื่อ-สกุล  รหัสนักศึกษา ',
        'student3': 'ชื่อ-สกุล  รหัสนักศึกษา ',
        'assessorname1' : 'คณาจารย์ผู้ร่วมนิเทศงาน 1. ',
        'assessorname2' : 'คณาจารย์ผู้ร่วมนิเทศงาน 2. ',
        'verse1':'1.คณาจารย์นิเทศเข้านิเทศตามกำหนดการนิเทศที่แจ้งไว้ก่อนหน้า',
        'verse2':'2.ระยะเวลาในการเข้านิเทศงานนักศึกษา 1 ชั่วโมง หรือมากกว่า ',
        'verse3':'3.การติดต่อประสานงานของคณาจารย์นิเทศก่อนถึงสถานประกอบการ		 ',
        'verse4':'4.ประเด็นคำถามเกี่ยวข้องกับนักศึกษาสหกิจศึกษา		',
        'verse5':'5.การให้ข้อมูลเกี่ยวกับโครงการสหกิจศึกษาของมหาวิทยาลัยฯ ',
        'verse6':'6.มนุษยสัมพันธ์ของคณาจารย์นิเทศ ',
        
    

    }
        


      